#ifndef CIRCLE_H
#define CIRCLE_H
#define _CRT_SECURE_NO_WARNINGS
#include <cmath>;
#include <iostream>;

//ќписание класса круг
//–азработать класс Circle(круг), содержащий следующие пол€ :
//
//radius - радиус
//ference - длина окружности
//area - площадь круга
//ƒанные пол€ рекомендуетс€ объ€вить как переменные типа double и с модификатором доступа private дл€ безопасности.ƒоступ к этим пол€м следует ограничить с помощью методов класса.
//
//¬ класс Circle включить конструктор, принимающий значение радиуса.
//
// ласс должен об€зательно содержать методы :
//
//setRadius()
//setFerence()
//setArea()
//getRadius()
//getFerence()
//getArea()
//«амечание
//
//при установке значени€ радиуса пересчитывать длину окружности и площадь;
//при установке длины окружности пересчитывать радиус и площадь;
//при установке площади пересчитывать радиус и длину окружности.

class Circle
{
private:
public:
};
#endif

