#ifndef DATATIME_H
#define DATATIME_H
#define _CRT_SECURE_NO_WARNINGS
#include <cmath>;
#include <iostream>;


//–азработать класс DateTime дл€ работы с датой / временем.
//
//¬ качестве основы вз€ть функции и структуры дл€ работы с временем из стандартной библиотеки(struct tm, time, localtime, mktime)
//
//ƒобавить в класс DateTime следующие методы :
//
//конструктор с трем€ числовыми параметрами(день, мес€ц, год);
//конструктор без параметров(объект использует текущую дату);
//конструктор копировани€(создаЄм копию другого объекта);
//getToday() - возвращение текущей даты в виде строки, с указанием дн€ недели и названи€ мес€ца(например 07 november 2018, wedensday);
//getYesterday() - возвращение даты вчерашнего дн€ в виде строки.
//getTomorrow() - возвращение даты завтрашнего дн€ в виде строки.
//getFuture(unsigned int N) - возвращение даты через N дней в будущем;
//getPast(unsigned int N) - возвращение даты через N дней в прошлом;
//getDifference(DateTime&) - дл€ расчЄта разницы(в дн€х) между двум€ датами
//ƒл€ работы со строками используетс€ тип std::string


//class DataTime
//{
//private:
//public:
//};
#endif

