#include "Circle.h"
#define _CRT_SECURE_NO_WARNINGS


using namespace std;

int main()
{
	Circle Earth(637810.0); // в метрах
	Circle rope(637810.0);
	cout << "Enter the length of the piece of rope added (metres)" << endl;
	double add;
	cin >> add;



	/*"Земля и верёвка"

		Решить с использованием класса Circle следующую задачу :

	Представим, что земля имеет форму идеального шара.
	Вокруг поверхности земного шара туго натянута верёвка(между ней и поверхностью нет никакого зазора).
	Кто - то разрезает верёвку в произвольном месте и добавляет кусок верёвки длиной 1 метр.После вставки между поверхностью земли
	и верёвкой возникает зазор, вызванный увеличением длины.Найти величину этого зазора.Примем за радиус земли расстояние в 6378.1 км*/
	//решение задачи Земля и веревка

	return 0;
}


